/**
 * Created by nikolay on 23.02.15.
 */
var request = require('request');
var text = 'ты сука, пидор, блядь, мудло, уебище, ебосос, хуисоска, педрилка, вафел, еблан, пидарас, уебок, хуила, мудила, блядина, уебанок, трахарила, ебарила, гавносос, миньетчик, пидэраст, пиздоеб, дрочер, жопа, сцукаблянах, пиздарас, хуеплет, пиздолиз, хуй, мудак, хуяк, ебак, сцука, уебина, чмо, вафлеглот, гавноеб, захуятор, пидар, хуиман, хуеб, ёблядь, хуёблядь, еб, ебалдуй, пиздун, хуесос, ебил, выблядок, гавноед, гавнажуй, долбаеб, выебок, мудоеб, обмудок, овцееб, свиноеб, ебозер, ахуятэр, хуетрон, хуеглот, мудень, залупа, злоуебок, гандон, хуесрань, пиздец, пиздюк, хуйло и ПАРАША!!!Я ЕБАЛ ТВОЮ МАТЬ!!!!!!!Ты полнейший пятисотпроцентный ОТЪЕБ!!! Ты самый проебанный ПИДОТРОН в мире! Тебя охуярила каждая блядь, тебя ебала вся страна, тебе В ЕБАЛО пиздили все долбаебы!!! Твое ебало полно опыта сосания, и оно все покрыто пиздозвонской хуйней!!! Ты гавеное тупоебалдовое ПИЗДОПРОМУДИЩЕ!!! Ты ГАВНОЕБ!! Тебя охуярил весь интернет, так как ты Г А В Н О Е Б!!! Я твою всю родню ебал!!! Твоя семья - полнейшие мудеры! У тебя нету своей собственной матери!! Ты ХУЕБ!!! Ты смесь отъебанной в жопу хуёбляди, и гавеного еблопиздарственного долбаеба!! Ха ха ХА ХА! Ты МУДЯРА!!! ты ЕБОТРОН всего мира!! Твоё место - САМЫЙ ПРОГАВНЕННЫЙ ТУАЛЕТ В МИРЕ!!!А ОН НАХОДИЦЦА В ПОДВАЛЕ ЗДАНИЯ ШКОЛЫ МИНЬЕТА!!!Ты фанат посасывания старых объебанных гандосекоффских ХУЕВ! Ты любитель повылизывать жопу хуярских ебалдуев!!! Ты ЛИЖЕШЬ Анус В.В.ПУТИНА!! Ты ХУЕФФ ПАДОНАК!!! Ты самое самое самое самое самое ПИЗДОМУДОБЛЯДОХУЕПИДОЕБОГАНДОГАВНОДРОЧЕТРОНИЩЕ!!!!!!! Соси хуй ебалдуй задроченый!!!Я буду ЕБАТЬ твою мать в ночь на 25 января,я ОТЪЕБУ её так, что у неё на теле будут видны две с половиной тысячи дырок от моего ХУЯ!!Ха ха Ты самый пропизженный мудоеб во вселенной!!!Твои родители такие же ёбыри и распиздяи как ты!!! Они целый день занимаюцца ананизмом!!! И к тому же все вы закончили высшую школу миньета и поэтому НОЧУЕТЕ В ЕЕ ПОДВАЛЕ!!!! Ты как-нибудь сходи в Макдоналдс, возьми с собой картофель, и я ОБЯЗАТЕЛЬНО ЕГО ОТРАВЛЮ!!! И ВСЕ СОУСЫ БУДУТ ПАХНУТЬ ПИЗДОЙ!!! Это всё потому что ты ДРОЧЕР!!!!!!!!!!!!!! В твоём желудке находицца ленточный червь – бычий цепень, и его друг – печёночный сосальщик, они не дадут тебе спокойно спать!!!! Проверь своё аналное отверстие, наверняка оттуда торчит его кончик. Это он тебя своим хуем изнутри ебет в жопу. В детстве тебя регулярно похищали инопланетяне и ставили на тебе сексуальные опыты, так что заткни свое недоросшее ебало и соси!!!Я сто раз ебал твою мать!!Ты сосал у своего ОТЦА!!Ты сверх долбаеб мудотронский!!Ты ДАЛБОЁБИНА НЕДАЕБАНАЯ!!Ты УЁБИЩЕ ЕБАРМОЦКОЕ!Ты ЕБАЛДУЙ!!!!!!!!!!!!!!!Ты ХУЕБЛЯДСКИЙ ПИЗДОМУДОПРОХУЁБ!!!!!!!!!!!!Таких как ты надо раком ебать!!Я сперва ебану твою мать,после чего она обоссыцца и ты слижишь её гавно с её ванючей жопы!!!Потом я возьму и нассу за шиворот твоему отцу и нассу ему в карман!! ТЫ МНЕ СЦУКА БЛЯ ЗАПЛАТИШЬ!!! Я переебал твою злосучью мамашу нах сто раз и насрал ей в глаз!после такого прихода у неё из сраки выволился ты!!ТЫ МУДОЗВОНСКОЕ УЁБИЩЕ!и ты стал ебать свою БАБКУ в ЕБАЛО и лизать у неё пиздень!!Ты гавносос недаебаный!ты самая в жопу ебанутая ОВЦА!Ты Переёбаный в жопу АЦТОЙ!Ты сосал у своего отца и он за это СРАЛ тебе в ЕБАЛО!МОЖЕШ СМЕЛо идти нахуй с интернета!!Таких как ты лошар только осталось ОЕБАШИТЬ Ногами!!Я на тебя срал с НЕБОСКРЁБА!!ты ПЕТУНЬЯ!!Недоебанная!!ПАШОЛ ты нахуй!!Тупой ПИНДОС!! Я тебя ТРИТОНИЛ в ГЛАНДы и потом я взял твой лысый черепок и ебашил его 10 часов об батарею.После этого ты стал ЕБАНОМ!Ты теперь ПИДАРСКИЙ АЦТОЙ!!УЁБИЩЕ пойди зделай плисет своей маме и подннюхай у своей бабки.Потом пососи у папы!!!А потом я буду ебать твую уёбистую мать,я Блевану твоему Отцу в ебало и насру в карман!Открой Ебало мне пёрднуть некуда!!ты ЛОШАРА!!Ты сосал у всего интернета!!Ты захавал свой потный носок!!ты ДАЛБОЁБ тупорылый!!!Поцелуй негра в Жопу !!Ты тупой АЦТОЙ!!Ну тебя ннахуй.Ты СВЕРХУЁБИЩЕ!!Ты Гнилой и тупой очкарик которого все ебали в ебало.иди поебись со своей мамой!Ты ПЕДОФИЛ Очкастый!!Ты ЕБУЧИЙ в ЖОПУ ШАКАЛ!Волчара позорный!ты Прыщ на залупе.СЮДААААА ИДИ АДМИН СУКА НАХУЙ ЩА БУДЕМ ТЕБЕ ЕБАЛО РАЗБИВАТЬ МРАЗЬ    ПОЛУЧАЙ ГОВНО         НА  НА  НА    УМИРААААЙ    СУКА БЛЯДЬ ТЕБЕ МАЛО???    ПОНЯЛ БЛЯДЬ    НА ЕЩЕ ГОВНО СРАНОЕ    ЖРИ МРАААЗЬ СУКА ЗАЕБАЛ     ТЫ ПОНИМАЕШЬ ЧТО ЗАЕБАЛ МЕНЯ     НА НАХУЙ СУКА БЛЯДЬ. БУДЕТ С КАЖДЫМ ДЖИПЕГОМ ШАКАЛЫ ЕБУЧИЕ БЛЯТЬ Я ВАС СОЖМУ БЛЯТЬ    ЦП В ЛС СУКА Я В ТВОЮ ЖОПУ ЗАСОВЫВАЛ ИДИ ГОВНО ЧИСТИТЬ  НА РАБОТУ БЫСТРА  БЛЯТЬ И ДВЕРЬ МНЕ ЗАПИЛИЛ АДМИН ЕБАНЫЙ  МУДОЗВОН Давай разберем все тобою написанное. Складывается впечатление что ты реально конт';
var textArr = text.split(' ');
for(var i = textArr.length - 1; i >=0; --i ) {
  if(textArr[i] == '') textArr.splice(i,1);
}
var token = '46590a6a990841138ff1bce257b3485d167ca51760038959559c1bde6014ff9716d46d5733a42c55c2bb7';
var tokenAposting = '2f3b9efb3ac528935e925b63c340efe9645ddb1ad6c2c9cb9f84c5592694632fd97a51c8dc804d7cc1f41';
var id2 = '8225679';
var id = '29270122';

var methodUrl = 'https://api.vk.com/method/messages.send?user_id=' + id2 + '&message=hjgggggjhgjhg&&access_token=' + tokenAposting;

request(methodUrl, function(err, respond, body) {
  if(err) return console.error(err);
  body = JSON.parse(body);
  if(!body || !body.response) {
    console.error(new Error('Something wrong'));
    console.error(body);
  }
  console.log(body.response);
});

/*for (i = 0 ; i < textArr.length + 1; ++i) {
  (function(i, text) {
    setTimeout(function() {
      send(text,i);
    }, 1500*i);
  }(i, textArr[i]));
}*/


function send(message, i) {
  var methodUrl = 'https://api.vk.com/method/wall.post?owner_id=' + id2 + '&friends_only=0&message=' + message +
    '&access_token=' + token/*+'&captcha_sid=520933986330&captcha_key=zhy1n2'*/;
  request(methodUrl, function(err, respond, body) {
    if(err) return console.error(err);
    body = JSON.parse(body);
    if(!body || !body.response || !body.response.post_id) {
      console.error(new Error('Something wrong'));
      console.error(body);
    }
    console.log(body.response, ' ' + i);
  });
}


